export const POKEMON_DATA = {
    "フシギバナ": 3, "リザードン": 6, "カメックス": 9, "スピアー": 15, "ピジョット": 18,
    "アーボック": 24, "ピカチュウ": 25, "ライチュウ": 26, "ライチュウ(アローラ)": 10100, "ピクシー": 36,
    "キュウコン": 38, "キュウコン(アローラ)": 10104, "ラフレシア": 45, "ウインディ": 59, "ウインディ(ヒスイ)": 10230,
    "フーディン": 65, "カイリキー": 68, "ウツボット": 71, "ヤドラン": 80, "ヤドラン(ガラル)": 10165,
    "ゲンガー": 94, "ガルーラ": 115, "スターミー": 121, "カイロス": 127, "ケンタロス": 128,
    "ケンタロス(パルデア単)": 10250, "ケンタロス(パルデア炎)": 10251, "ケンタロス(パルデア水)": 10252, "ギャラドス": 130, "メタモン": 132,
    "シャワーズ": 134, "サンダース": 135, "ブースター": 136, "プテラ": 142, "カビゴン": 143,
    "カイリュー": 149, "メガニウム": 154, "バクフーン": 157, "バクフーン(ヒスイ)": 10233, "オーダイル": 160,
    "アリアドス": 168, "デンリュウ": 181, "マリルリ": 184, "ニョロトノ": 186, "エーフィ": 196,
    "ブラッキー": 197, "ヤドキング": 199, "ヤドキング(ガラル)": 10172, "フォレトス": 205, "ハガネール": 208,
    "ハリーセン": 211, "ハッサム": 212, "ヘラクロス": 214, "エアームド": 227, "ヘルガー": 229,
    "バンギラス": 248, "ジュカイン": 254, "バシャーモ": 257, "ラグラージ": 260, "ペリッパー": 279,
    "サーナイト": 282, "ヤミラミ": 302, "クチート": 303, "ボスゴドラ": 306, "チャーレム": 308,
    "ライボルト": 310, "サメハダー": 319, "バクーダ": 323, "コータス": 324, "チルタリス": 334,
    "ミロカロス": 350, "ポワルン": 351, "ジュペッタ": 354, "チリーン": 358, "アブソル": 359,
    "オニゴーリ": 362, "メタグロス": 376, "ドダイトス": 389, "ゴウカザル": 392, "エンペルト": 395,
    "ムクホーク": 398, "レントラー": 405, "ロズレイド": 407, "ラムパルド": 409, "トリデプス": 411,
    "ミミロップ": 428, "ミカルゲ": 442, "ガブリアス": 445, "ルカリオ": 448, "カバルドン": 450,
    "ドクロッグ": 454, "ユキノオー": 460, "マニューラ": 461, "ドサイドン": 464, "リーフィア": 470,
    "グレイシア": 471, "グライオン": 472, "マンムー": 473, "エルレイド": 475, "ユキメノコ": 478,
    "ロトム": 479, "ヒートロトム": 10008, "ウォッシュロトム": 10009, "フロストロトム": 10010, "スピンロトム": 10011,
    "カットロトム": 10012, "ジャローダ": 497, "エンブオー": 500, "ダイケンキ": 503, "ダイケンキ(ヒスイ)": 10236,
    "ミルホッグ": 505, "レパルダス": 510, "ヤナッキー": 512, "バオッキー": 514, "ヒヤッキー": 516,
    "ムシャーナ": 518, "ドリュウズ": 530, "タブンネ": 531, "ローブシン": 534, "ペンドラー": 545,
    "エルフーン": 547, "ワルビアル": 553, "ズルズキン": 560, "デスカーン": 563, "ダストダス": 569,
    "ゾロアーク": 571, "ゾロアーク(ヒスイ)": 10239, "ランクルス": 579, "バイバニラ": 584, "エモンガ": 587,
    "シビルドン": 604, "シャンデラ": 609, "ツンベアー": 614, "マッギョ": 618, "マッギョ(ガラル)": 10180,
    "ゴルーグ": 623, "サザンドラ": 635, "ウルガモス": 637, "ブリガロン": 652, "マフォクシー": 655,
    "ゲッコウガ": 658, "ホルード": 660, "ファイアロー": 663, "ビビヨン": 666, "カエンジシ": 668,
    "フラエッテ(えいえん)": 10061, "フラージェス": 671, "ゴロンダ": 675, "トリミアン": 676, "ニャオニクス♂": 678,
    "ニャオニクス♀": 10025, "ギルガルド": 681, "フレフワン": 683, "ペロリーム": 685, "カラマネロ": 687,
    "ガメノデス": 689, "ドラミドロ": 691, "ブロスター": 693, "エレザード": 695, "ガチゴラス": 697,
    "アマルルガ": 699, "ニンフィア": 700, "ルチャブル": 701, "デデンネ": 702, "ヌメルゴン": 706,
    "ヌメルゴン(ヒスイ)": 10242, "クレッフィ": 707, "オーロット": 709, "パンプジン(普通)": 711, "パンプジン(小)": 10030,
    "パンプジン(大)": 10031, "パンプジン(特大)": 10032, "クレベース": 713, "クレベース(ヒスイ)": 10243, "オンバーン": 715,
    "ジュナイパー": 724, "ジュナイパー(ヒスイ)": 10244, "ガオガエン": 727, "アシレーヌ": 730, "ドデカバシ": 733,
    "ケケンカニ": 740, "ルガルガン(まひる)": 745, "ルガルガン(まよなか)": 10126, "ルガルガン(たそがれ)": 10152, "ドヒドイデ": 748,
    "バンバドロ": 750, "オニシズクモ": 752, "エンニュート": 758, "アマージョ": 763, "ヤレユータン": 765,
    "ナゲツケサル": 766, "ミミッキュ": 778, "ジジーロン": 780, "ジャラランガ": 784, "アーマーガア": 823,
    "アップリュー": 841, "タルップル": 842, "サダイジャ": 844, "ポットデス": 855, "ブリムオン": 858,
    "オーロンゲ": 861, "バリコオル": 866, "デスバーン": 867, "マホイップ": 869, "タイレーツ": 870,
    "モルペコ": 877, "ドラパルト": 887, "アヤシシ": 899, "バサギリ": 900, "イダイトウ♂": 902,
    "イダイトウ♀": 10248, "オオニューラ": 903, "ハリーマン": 904, "マスカーニャ": 908, "ラウドボーン": 911,
    "ウェーニバル": 914, "イッカネズミ": 925, "キョジオーン": 934, "グレンアルマ": 936, "ソウブレイズ": 937,
    "ハラバリー": 939, "スコヴィラン": 952, "クエスパトラ": 956, "デカヌチャン": 959, "イルカマン": 964,
    "ミミズズ": 968, "キラフロル": 970, "ハカドッグ": 972, "コノヨザル": 979, "リキキリン": 981,
    "ドドゲザン": 983, "サーフゴー": 1000, "カミツオロチ": 1011, "ヤバソチャ": 1013, "ブリジュラス": 1018
};

const kata2hira = (str) => str.replace(/[\u30a1-\u30f6]/g, match => String.fromCharCode(match.charCodeAt(0) - 0x60));

export const fullPokeList = [];
export const POKE_BY_ID = {};

Object.entries(POKEMON_DATA).forEach(([name, id]) => {
    const p = { id, name, hira: kata2hira(name) };
    fullPokeList.push(p);
    POKE_BY_ID[id] = p;
});